2021.10.19.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2021.10.12.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2021.10.26.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of October 12 to 19, 2021.

#+TOC: headlines 1


* Verification for Dummies: SMT and Induction
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/verification-for-dummies-smt-and-induction/8631/1

** OCamlPro announced


We are pleased to share with you [[https://www.ocamlpro.com/2021/10/14/verification-for-dummies-smt-and-induction/][Verification for Dummies: SMT and
Induction]], a complete and detailed
series of blogposts written by Adrien Champion about Induction as a formal verification technique.

The subject is treated with many concrete and executable examples. All examples can be (and should be) launched
locally by readers thanks to small and easy to find tools. Modification and experimentation are strongly encouraged!

Take a look at all the notions covered:

- introduction to formal logics and formal frameworks;
- SMT-solving: modern, low-level verification building blocks;
- declarative transition systems;
- transition system unrolling;
- BMC and induction proofs over transition systems;
- candidate strengthening.

We hope you enjoy reading and we look forward to your feedback!
      



* OCaml Café: Wed, Oct 13 @ 1pm (U.S. Central)
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ocaml-cafe-wed-oct-13-1pm-u-s-central/8610/14

** Claude Jager-Rubinson announced


The video of @dra27's talk on OPAM is now available: https://youtu.be/RHSdlH4el0g. Thanks so much for the great talk,
David!  And thanks to everybody who attended!  (The video starts a couple of minutes into the talk because yours
truly forgot to start recording.  D'oh!)

We already have some ideas for the next meeting but if there's a topic that you'd like to hear about or are
interested on presenting on, please message me.
      



* Windows-friendly OCaml 4.12 distribution 2nd preview release (0.2.0)
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-windows-friendly-ocaml-4-12-distribution-2nd-preview-release-0-2-0/8488/3

** jbeckford announced


0.2.5 is available. This release brings significant user friendly improvements.

There is a new binary called ~with-dkml.exe~. Just plop ~with-dkml~ in front of a Windows command that requires
access to Unix scripts (ie. ~with-dkml opam install~) and it should just work.

There is now a section called **Beyond Basics** in [[https://diskuv.gitlab.io/diskuv-ocaml/index.html][the Diskuv OCaml user
documentation]] that walks through:
- the first and second tutorials of [[https://ocaml.org/learn/tutorials/][Getting Started - Learn OCaml]]
- the bare Opam essentials you need as a beginner (how to find and select an Opam switch, and how to find and install packages using ~with-dkml opam install~), all without leaving the Command Prompt
- installing Visual Studio Code with the OCaml plugin

Huge thanks to @Butanium who lent me much of his time to validate usability from the perspective of a newcomer. More
feedback is always welcome.

Links:
- [[https://diskuv.gitlab.io/diskuv-ocaml/index.html#two-step-installation-instructions][Installation instructions for the latest version]]
- [[https://gitlab.com/diskuv/diskuv-ocaml/-/releases][Release notes for all versions]]

PS. You won't need ~with-dkml~ most of the time. The Beyond Basics documentation shows how to run Dune and the OCaml
native compiler directly from the Visual Studio Command Prompt.
      



* Release of ocaml-sf/learn-ocaml:0.13.0
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-release-of-ocaml-sf-learn-ocaml-0-13-0/8577/6

** Erik Martin-Dorel announced


Just FYI, a bugfix release learn-ocaml ~0.13.1~ has just been tagged and:

- [[https://github.com/ocaml-sf/learn-ocaml/releases/tag/v0.13.1][released in GitHub]] ← see the Release Notes and binaries-assets
- [[https://hub.docker.com/r/ocamlsf/learn-ocaml/tags][pushed to Docker Hub]] ← ~ocamlsf/learn-ocaml~ being the official distribution of Learn-OCaml
- [[https://github.com/ocaml/opam-repository/pull/19787][submitted to OPAM default repository]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
