2021.10.19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-19 Tue 10:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.10.12.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.10.26.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of October 12 to 19, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Verification for Dummies: SMT and Induction</a></li>
<li><a href="#2">OCaml Café: Wed, Oct 13 @ 1pm (U.S. Central)</a></li>
<li><a href="#3">Windows-friendly OCaml 4.12 distribution 2nd preview release (0.2.0)</a></li>
<li><a href="#4">Release of ocaml-sf/learn-ocaml:0.13.0</a></li>
<li><a href="#orgabe1cdf">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Verification for Dummies: SMT and Induction</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/verification-for-dummies-smt-and-induction/8631/1">https://discuss.ocaml.org/t/verification-for-dummies-smt-and-induction/8631/1</a>
</p>
</div>

<div id="outline-container-org53a2b75" class="outline-3">
<h3 id="org53a2b75">OCamlPro announced</h3>
<div class="outline-text-3" id="text-org53a2b75">
<p>
We are pleased to share with you <a href="https://www.ocamlpro.com/2021/10/14/verification-for-dummies-smt-and-induction/">Verification for Dummies: SMT and
Induction</a>, a complete and detailed
series of blogposts written by Adrien Champion about Induction as a formal verification technique.
</p>

<p>
The subject is treated with many concrete and executable examples. All examples can be (and should be) launched
locally by readers thanks to small and easy to find tools. Modification and experimentation are strongly encouraged!
</p>

<p>
Take a look at all the notions covered:
</p>

<ul class="org-ul">
<li>introduction to formal logics and formal frameworks;</li>
<li>SMT-solving: modern, low-level verification building blocks;</li>
<li>declarative transition systems;</li>
<li>transition system unrolling;</li>
<li>BMC and induction proofs over transition systems;</li>
<li>candidate strengthening.</li>
</ul>

<p>
We hope you enjoy reading and we look forward to your feedback!
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">OCaml Café: Wed, Oct 13 @ 1pm (U.S. Central)</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-cafe-wed-oct-13-1pm-u-s-central/8610/14">https://discuss.ocaml.org/t/ocaml-cafe-wed-oct-13-1pm-u-s-central/8610/14</a>
</p>
</div>

<div id="outline-container-org3cea503" class="outline-3">
<h3 id="org3cea503">Claude Jager-Rubinson announced</h3>
<div class="outline-text-3" id="text-org3cea503">
<p>
The video of @dra27's talk on OPAM is now available: <a href="https://youtu.be/RHSdlH4el0g">https://youtu.be/RHSdlH4el0g</a>. Thanks so much for the great talk,
David!  And thanks to everybody who attended!  (The video starts a couple of minutes into the talk because yours
truly forgot to start recording.  D'oh!)
</p>

<p>
We already have some ideas for the next meeting but if there's a topic that you'd like to hear about or are
interested on presenting on, please message me.
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">Windows-friendly OCaml 4.12 distribution 2nd preview release (0.2.0)</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-windows-friendly-ocaml-4-12-distribution-2nd-preview-release-0-2-0/8488/3">https://discuss.ocaml.org/t/ann-windows-friendly-ocaml-4-12-distribution-2nd-preview-release-0-2-0/8488/3</a>
</p>
</div>

<div id="outline-container-org885907a" class="outline-3">
<h3 id="org885907a">jbeckford announced</h3>
<div class="outline-text-3" id="text-org885907a">
<p>
0.2.5 is available. This release brings significant user friendly improvements.
</p>

<p>
There is a new binary called <code>with-dkml.exe</code>. Just plop <code>with-dkml</code> in front of a Windows command that requires
access to Unix scripts (ie. <code>with-dkml opam install</code>) and it should just work.
</p>

<p>
There is now a section called <b><b>Beyond Basics</b></b> in <a href="https://diskuv.gitlab.io/diskuv-ocaml/index.html">the Diskuv OCaml user
documentation</a> that walks through:
</p>
<ul class="org-ul">
<li>the first and second tutorials of <a href="https://ocaml.org/learn/tutorials/">Getting Started - Learn OCaml</a></li>
<li>the bare Opam essentials you need as a beginner (how to find and select an Opam switch, and how to find and install packages using <code>with-dkml opam install</code>), all without leaving the Command Prompt</li>
<li>installing Visual Studio Code with the OCaml plugin</li>
</ul>

<p>
Huge thanks to @Butanium who lent me much of his time to validate usability from the perspective of a newcomer. More
feedback is always welcome.
</p>

<p>
Links:
</p>
<ul class="org-ul">
<li><a href="https://diskuv.gitlab.io/diskuv-ocaml/index.html#two-step-installation-instructions">Installation instructions for the latest version</a></li>
<li><a href="https://gitlab.com/diskuv/diskuv-ocaml/-/releases">Release notes for all versions</a></li>
</ul>

<p>
PS. You won't need <code>with-dkml</code> most of the time. The Beyond Basics documentation shows how to run Dune and the OCaml
native compiler directly from the Visual Studio Command Prompt.
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Release of ocaml-sf/learn-ocaml:0.13.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-release-of-ocaml-sf-learn-ocaml-0-13-0/8577/6">https://discuss.ocaml.org/t/ann-release-of-ocaml-sf-learn-ocaml-0-13-0/8577/6</a>
</p>
</div>

<div id="outline-container-orgaed12fb" class="outline-3">
<h3 id="orgaed12fb">Erik Martin-Dorel announced</h3>
<div class="outline-text-3" id="text-orgaed12fb">
<p>
Just FYI, a bugfix release learn-ocaml <code>0.13.1</code> has just been tagged and:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml-sf/learn-ocaml/releases/tag/v0.13.1">released in GitHub</a> ← see the Release Notes and binaries-assets</li>
<li><a href="https://hub.docker.com/r/ocamlsf/learn-ocaml/tags">pushed to Docker Hub</a> ← <code>ocamlsf/learn-ocaml</code> being the official distribution of Learn-OCaml</li>
<li><a href="https://github.com/ocaml/opam-repository/pull/19787">submitted to OPAM default repository</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgabe1cdf" class="outline-2">
<h2 id="orgabe1cdf">Old CWN</h2>
<div class="outline-text-2" id="text-orgabe1cdf">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org77ad143">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
